Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыТорговогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыТорговогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOffline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговаяСистема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFIDМеток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВозврат/Forms/ФормаСпискаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтчетЗаявкиНаВозврат(Команда)
		
	ОтчетОбъект = Отчеты.ЗаявкиНаВозврат.Создать();
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");		
	ФормаНастройки = ОтчетОбъект.ПолучитьФормуНастроек();	
	
	ЗначениеВозврата = ФормаНастройки.ОткрытьМодально();	
	Если ЗначениеВозврата = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 

	//Очищаем поле табличного документа                           
	ФормаОтчета = ОтчетОбъект.ПолучитьФорму();	
	
	ДанныеРасшифровки = ФормаОтчета.ДанныеРасшифровки;
	Результат = ФормаОтчета.ЭлементыФормы.Результат;	
	Результат.Очистить();
	
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Создаем Макет КД
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Создаем Процесор КД	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	
	ФормаОтчета.ДанныеРасшифровки = ДанныеРасшифровки;
	
	ФормаОтчета.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненностиДокумента(Команда)

	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда
		Возврат
	КонецЕсли;  	
	
	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Элементы.Список.ТекущаяСтрока.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма); 
	//+Марков И. 05.11.2025 #UT10-5494
	ШтрихкодЗакрываемогоДокумента = "";
	//-Марков И. 05.11.2025 #UT10-5494
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);  
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//+Марков И. 05.11.2025 #UT10-5494
	Если НЕ ЗначениеЗаполнено(Данные) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не СокрЛП(Источник) = "Вручную" Тогда 	
		
		Если ЗначениеЗаполнено(ШтрихкодЗакрываемогоДокумента) И ШтрихкодЗакрываемогоДокумента = Данные Тогда
		
			ШтрихкодЗакрываемогоДокумента = "";
			Возврат;
		
		КонецЕсли;
		
		Если Не ВводДоступен() Тогда
			Возврат;
		КонецЕсли;     
		
	КонецЕсли;
	//-Марков И. 05.11.2025 #UT10-5494
	
	ДокЗаявка = Неопределено;
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаявкаНаВозврат.ПустаяСсылка"));   
	МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Данные, Менеджеры);
	
	Если НЕ МассивСсылок.Количество() = 0  Тогда
		
		ДокЗаявка = МассивСсылок[0];  
		
		Если ДокЗаявка.Статус = "Отказ в возврате" Тогда
		 	Предупреждение("В документе " + СокрЛП(ДокЗаявка) + Символы.ПС + "установлен статус 'Отказ в возврате' !", 15, "ВНИМАНИЕ !");				
		КонецЕсли;
		
		//+Марков И. 05.11.2025 #UT10-5494
		Форма = ДокЗаявка.ПолучитьФорму("ФормаДокумента", ЭтаФорма);
		Форма.Открыть();
		//-Марков И. 05.11.2025 #UT10-5494

	Иначе
		
		//+Шульман А. 24.09.2025 #UT10-5433
		Реализация = ШтрихкодированиеПечатныхФорм.ПолучитьРеализациюПоШтрихкоду(Данные);  
		
		Если ЗначениеЗаполнено(Реализация) Тогда       
			
			ДокЗаявка = ПолучитьЗаявкуНаВозвратПоРеализации(Реализация);         
			
			Если ЗначениеЗаполнено(ДокЗаявка) Тогда
			
				Если ДокЗаявка.Статус = "Отказ в возврате" Тогда
				 	Предупреждение("В документе " + СокрЛП(ДокЗаявка) + Символы.ПС + "установлен статус 'Отказ в возврате' !", 15, "ВНИМАНИЕ !");				
				КонецЕсли;
				
				//+Марков И. 05.11.2025 #UT10-5494
				Форма = ДокЗаявка.ПолучитьФорму("ФормаДокумента", ЭтаФорма);
				Форма.Открыть();
				//-Марков И. 05.11.2025 #UT10-5494      
				
			Иначе
				Сообщить("Документ ""Заявка на возврат"" по реализации со штрихкодом " + Данные + " не найден");
			КонецЕсли;
			
		Иначе
		//-Шульман А. 24.09.2025 #UT10-5433
			Сообщить("Документ ""Заявка на возврат"" со штрихкодом " + Данные + " не найден");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПоддерживаетсяВидТО(Вид) Экспорт
	
	Результат = Ложь;  
	
	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода
	 Или Вид = Перечисления.ВидыТорговогоОборудования.ТерминалСбораДанных
	 Или Вид = Перечисления.ВидыТорговогоОборудования.СчитывательRFIDМеток Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат; 
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьРеализациюПоШтрихкоду(Штрихкод)

	Возврат ШтрихкодированиеПечатныхФорм.ПолучитьРеализациюПоШтрихкоду(Штрихкод);

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьЗаявкуНаВозвратПоРеализации(Реализация)
	
	//+Шульман А. 24.09.2025 #UT10-5433
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаВозврат.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
		|ГДЕ
		|	НЕ ЗаявкаНаВозврат.ПометкаУдаления
		|	И ЗаявкаНаВозврат.Реализация = &Реализация
		|	И ЗаявкаНаВозврат.ОформленоНаПланшете";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	//-Шульман А. 24.09.2025 #UT10-5433

КонецФункции // ()

&НаКлиенте
Процедура ВвестиВручную(Команда)
	
	//+Шульман А. 24.09.2025 #UT10-5433
	ШКРучной = "";
	
	Если ВвестиСтроку(ШКРучной, "Введите штрихкод", 100, Ложь) Тогда
		
		Если ЗначениеЗаполнено(ШКРучной) Тогда
			ВнешнееСобытие("Вручную", "", ШКРучной);
		КонецЕсли;
		
	КонецЕсли;
	//-Шульман А. 24.09.2025 #UT10-5433	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//+Марков И. 05.11.2025 #UT10-5494
	
	ШтрихкодЗакрываемогоДокумента = ВыбранноеЗначение; 
	
	//-Марков И. 05.11.2025 #UT10-5494
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаявкиСБезусловнымВозвратом(Команда)
	//+Сёмин Р. 17.11.2025 #UT10-5526
	ОткрытьФорму("Документ.ЗаявкаНаВозврат.Форма.ФормаСпискаУпрОтбор");
	//-Сёмин Р. 17.11.2025 #UT10-5526
КонецПроцедуры
